name: "gemini-2.0-flash-exp"
platform: "tensorrt_plan"
max_batch_size: 128

dynamic_batching {
  preferred_batch_size: [ 16, 32, 64, 128 ]
  max_queue_delay_microseconds: 500
  preserve_ordering: true
}

instance_group [
  {
    count: 2
    kind: KIND_GPU
    gpus: [ 0 ]
  }
]

optimization {
  execution_accelerators {
    gpu_execution_accelerator: [
      {
        name: "tensorrt"
        parameters {
          key: "precision_mode"
          value: "FP16"
        }
        parameters {
          key: "max_workspace_size_bytes"
          value: "1073741824"
        }
      }
    ]
  }
}

input [
  {
    name: "input_ids"
    data_type: TYPE_INT32
    dims: [ -1, 128 ]
  }
]

output [
  {
    name: "output_logits"
    data_type: TYPE_FP32
    dims: [ -1, 50257 ]
  }
]

version_policy {
  latest {
    num_versions: 2
  }
}

response_cache {
  enable: true
  cache_size: 1024
} 